espruino/Espruino/libs/network/esp8266/network_esp8266.c
/*
5 * network_esp8266_board.c

 *
 *  Created on: Aug 29, 2015
 *      Author: kolban
 */

/**
 * This file contains the implementation of the ESP8266_BOARD network interfaces at the TCP/IP
 * level.
 *
 * Design notes
 * ------------
 * We maintain an array of socketData structures.  The number of such structures is defined in the
 * MAX_SOCKETS define.  The private variable that contains the array is called "socketArray".
 * Each one of these array instances represents a possible socket that we can use.
 *
 * Within the code, this allows us to reference a socket instance by an integer.  For example,
 * socket 0 is the 1st instance in the array.
 *
 * Associated with the array are accessor functions:
 *
 * o getNextFreeSocket - Return the next free socket or -1 if there are no free sockets.
 * o getSocketData - Get the socketData structure corresponding to the socket integer.
 * o resetSocket - Reset the state of the socket and clean it up if needed.
 * o releaseSocket - Release the socket and return it to the pool of unused sockets.
 *
 */
// ESP8266 specific includes
#define ESPSDK_1_3_0
#include <c_types.h>
#include <user_interface.h>
#include <mem.h>
#include <osapi.h>
#include <espconn.h>
#include <espmissingincludes.h>

#define _GCC_WRAP_STDINT_H
typedef long long int64_t;

#include "network_esp8266.h"
#include "esp8266_board_utils.h"

/**
 * \brief The maximum number of concurrently open sockets we support.
 * We should probably pair this with the ESP8266 concept of the maximum number of sockets
 * that an ESP8266 instance can also support.
 */
#define MAX_SOCKETS (10)

#define LOG os_printf

static struct socketData *getSocketData(int s);

static int  getServerSocketByLocalPort(unsigned short port);
static void setSocketInError(int socketId, char *msg, int code);
static void dumpEspConn(struct espconn *pEspConn);
static int  getNextFreeSocket();
static void doClose(int socketId);
static void releaseSocket(int socketId);
static void resetSocket(int sckt);

static void esp8266_callback_connectCB_inbound(void *arg);
static void esp8266_callback_connectCB_outbound(void *arg);
static void esp8266_callback_disconnectCB(void *arg);
static void esp8266_callback_sentCB(void *arg);
static void esp8266_callback_writeFinishedCB(void *arg);
static void esp8266_callback_recvCB(void *arg, char *pData, unsigned short len);
static void esp8266_callback_reconnectCB(void *arg, sint8 err);

/**
 * \brief A data structure that represents a memory buffer.
 * A memory buffer is an object that represents a sized piece of memory.  Given a
 * memory buffer object, we know how big it is and can set or get data from it.
 */
struct memoryBuffer {
	/**
	 * \brief The size of data associated with this buffer.
	 */
	size_t length;

	/**
	 * \brief A pointer to the memory associated with this buffer.  This should be
	 * NULL if `length` is 0.
	 */
	uint8 *buf;
};

static uint8 *memoryBuffer_read(struct memoryBuffer *pMemoryBuffer, size_t readSize);
static uint8 *memoryBuffer_append(struct memoryBuffer *pMemoryBuffer, uint8 *pNewData, size_t length);
static void   memoryBuffer_delete(struct memoryBuffer *pMemoryBuffer);
static int    memoryBuffer_getSize(struct memoryBuffer *pMemoryBuffer);

/**
 * \brief The potential states for a socket.
 * See the socket state diagram.
 */
enum SOCKET_STATE {
	SOCKET_STATE_UNUSED,         //!< The socket is unused
	SOCKET_STATE_IDLE,           //!< The socket is idle
	SOCKET_STATE_CONNECTING,     //!< The socket is connecting
	SOCKET_STATE_TRANSMITTING,   //!< The socket is transmitting
	SOCKET_STATE_CLOSING,        //!< The socket is closing
	SOCKET_STATE_HOST_RESOLVING, //!< Resolving a a hostname
	SOCKET_STATE_ERROR           //!< The socket is in error
};

/**
 * void initSocketData()
 * int getNextFreeSocket()
 * void releaseSocket(int s)
 * struct socketData *getSocketData(int s)
 */



/**
 * Here are some notes on the accepted list algorithms.
 *
 * tail - Where old entries are removed
 * head - Where new entries are added
 *
 * When tail = head - the list is empty
 *
 * When a new entry is added:
 * error: mod(head+1) == tail  // List full
 * *head = new entry
 * head = mod(head+1)
 *
 * When an old entry is removed
 * error: tail == head // List empty
 * retrieved entry = *tail
 * tail = mod(tail+1)
 *
 *
 *  0  1  2  3  4  5  6  7  8
 * [ ][ ][ ][ ][ ][ ][ ][ ][ ]
 */

/**
 * \brief The maximum number of accepted sockets that can be remembered.
 */
#define MAX_ACCEPTED_SOCKETS (10)

/**
 * \brief The core socket structure.
 * The structure is initialized by resetSocket.
 */
struct socketData {
	int		socketId;			//!< The id of THIS socket.
	enum SOCKET_STATE state;	//!< What is the socket state?
	bool    isConnected;		//!< Is this socket connected?
	bool    isServer;			//!< Are we a server?
	bool	shouldClose;		//!< Should this socket close when it can?

	struct  espconn *pEspconn;	//!< The ESPConn structure.

	struct  memoryBuffer txMemoryBuffer; //!< Data to be transmitted.
	uint8  *currentTx;			//!< Data currently being transmitted.
	uint8  *rxBuf;				//!< Data received (inbound).
	size_t  rxBufLen;			//!< The length of data in the buffer ready for consumption.

	char   *errorMsg;           //!< Error message.
	int     errorCode;          //!< Error code.

	/**
	 * \brief A list of accepted sockets.
	 * This array contains the storage of a list of sockets that have been accepted by this
	 * server socket but have not yet been delivered to Espruino.  A `head` and `tail`
	 * pair of indices are also associated.
	 */
	int     acceptedSockets[MAX_ACCEPTED_SOCKETS];

	/**
	 * \brief The head of the list of accepted sockets.
	 * The index into `acceptedSockets` where the next accepted socket will be placed.
	 */
	uint8   acceptedSocketsHead;

	/**
	 * \brief The tail of the list of accepted sockets.
	 * The index into `acceptedSockets` where the next accepted socket will be retrieved.
	 */
	uint8   acceptedSocketsTail;

};


/**
 * \brief An array of socket data structures.
 */
static struct socketData socketArray[MAX_SOCKETS];


/**
 * \brief An array of `esp_tcp` data structures.
 */
static esp_tcp tcpArray[MAX_SOCKETS];


/**
 * \brief An array of `struct espconn` data structures.
 */
static struct espconn espconnArray[MAX_SOCKETS];


/**
 * \brief Write the details of a socket to the debug log.
 * The data associated with the socket is dumped to the debug log.
 */
void esp8266_dumpSocket(
		int socketId //!< The ID of the socket data structure to be logged.
	) {
	struct socketData *pSocketData = getSocketData(socketId);
	LOG("Dump of socket=%d\n", socketId);
	LOG(" - isConnected=%d", pSocketData->isConnected);
	LOG(", isServer=%d", pSocketData->isServer);
	LOG(", acceptedSockets=[");
	int s=pSocketData->acceptedSocketsTail;
	while(s != pSocketData->acceptedSocketsHead) {
		LOG(" %d", pSocketData->acceptedSockets[s]);
		s = (s+1)%MAX_ACCEPTED_SOCKETS;
	}
	LOG("]");
	LOG(", rxBufLen=%d", pSocketData->rxBufLen);
	LOG(", tx length=%d", memoryBuffer_getSize(&(pSocketData->txMemoryBuffer)));
	LOG(", currentTx=0x%d", (int)pSocketData->currentTx);
	char *stateMsg;
	switch(pSocketData->state) {
	case SOCKET_STATE_CLOSING:
		stateMsg = "SOCKET_STATE_CLOSING";
		break;
	case SOCKET_STATE_CONNECTING:
		stateMsg = "SOCKET_STATE_CONNECTING";
		break;
	case SOCKET_STATE_ERROR:
		stateMsg = "SOCKET_STATE_ERROR";
		break;
	case SOCKET_STATE_IDLE:
		stateMsg = "SOCKET_STATE_IDLE";
		break;
	case SOCKET_STATE_TRANSMITTING:
		stateMsg = "SOCKET_STATE_TRANSMITTING";
		break;
	case SOCKET_STATE_HOST_RESOLVING:
		stateMsg = "SOCKET_STATE_HOST_RESOLVING";
		break;
	case SOCKET_STATE_UNUSED:
		stateMsg = "SOCKET_STATE_UNUSED";
		break;
	default:
		stateMsg = "Unexpected state!!";
		break;
	}
	LOG(", state=%s", stateMsg);
	LOG(", errorCode=%d", pSocketData->errorCode);

	// Print the errorMsg if it has anything to say
	if (pSocketData->errorMsg != NULL && strlen(pSocketData->errorMsg) > 0) {
		LOG(", errorMsg=\"%s\"", pSocketData->errorMsg);
	}

	LOG("\n");
} // End of dumpSocket


/**
 * \brief Dump a struct espconn (for debugging purposes).
 */
static void dumpEspConn(
		struct espconn *pEspConn //!<
	) {
	char ipString[20];
	LOG("Dump of espconn: 0x%x\n", (int)pEspConn);
	if (pEspConn == NULL) {
		return;
	}
	switch(pEspConn->type) {
	case ESPCONN_TCP:
		LOG(" - type = TCP\n");
		LOG("   - local address    = %d.%d.%d.%d [%d]\n",
				pEspConn->proto.tcp->local_ip[0],
				pEspConn->proto.tcp->local_ip[1],
				pEspConn->proto.tcp->local_ip[2],
				pEspConn->proto.tcp->local_ip[3],
				pEspConn->proto.tcp->local_port);
		LOG("   - remote address   = %d.%d.%d.%d [%d]\n",
				pEspConn->proto.tcp->remote_ip[0],
				pEspConn->proto.tcp->remote_ip[1],
				pEspConn->proto.tcp->remote_ip[2],
				pEspConn->proto.tcp->remote_ip[3],
				pEspConn->proto.tcp->remote_port);
		break;
	case ESPCONN_UDP:
		LOG(" - type = UDP\n");
		LOG("   - local_port  = %d\n", pEspConn->proto.udp->local_port);
		LOG("   - local_ip    = %d.%d.%d.%d\n",
				pEspConn->proto.tcp->local_ip[0],
				pEspConn->proto.tcp->local_ip[1],
				pEspConn->proto.tcp->local_ip[2],
				pEspConn->proto.tcp->local_ip[3]);
		LOG("   - remote_port = %d\n", pEspConn->proto.udp->remote_port);
		LOG("   - remote_ip   = %d.%d.%d.%d\n",
				pEspConn->proto.tcp->remote_ip[0],
				pEspConn->proto.tcp->remote_ip[1],
				pEspConn->proto.tcp->remote_ip[2],
				pEspConn->proto.tcp->remote_ip[3]);
		break;
	default:
		LOG(" - type = Unknown!! 0x%x\n", pEspConn->type);
	}
	switch(pEspConn->state) {
	case ESPCONN_NONE:
		LOG(" - state=NONE");
		break;
	case ESPCONN_WAIT:
		LOG(" - state=WAIT");
		break;
	case ESPCONN_LISTEN:
		LOG(" - state=LISTEN");
		break;
	case ESPCONN_CONNECT:
		LOG(" - state=CONNECT");
		break;
	case ESPCONN_WRITE:
		LOG(" - state=WRITE");
		break;
	case ESPCONN_READ:
		LOG(" - state=READ");
		break;
	case ESPCONN_CLOSE:
		LOG(" - state=CLOSE");
		break;
	default:
		LOG(" - state=unknown!!");
		break;
	}
	LOG(", link_cnt=%d", pEspConn->link_cnt);
	LOG(", reverse=0x%x\n", (unsigned int)pEspConn->reverse);
} // End of dumpEspConn


/**
 * \brief Get the next free socket.
 * Look for the first free socket in the array of sockets and return the first one
 * that is available after first flagging it as now in use.  If no available
 * socket can be found, return -1.
 */
static int getNextFreeSocket() {
	int i;
	for (i=0; i<MAX_SOCKETS; i++) {
		if (socketArray[i].state == SOCKET_STATE_UNUSED) {
			return i;
		}
	} // End of for each socket.
	return(-1);
} // End of getNextFreeSocket


/**
 * \brief Retrieve the socketData for the given socket index.
 */
static struct socketData *getSocketData(int s) {
	assert(s >=0 && s<MAX_SOCKETS);
	return &socketArray[s];
} // End of getSocketData


/**
 * \brief Find the server socket that is bound to the given local port.
 * \return The socket id of the socket listening on the given port or -1 if there is no
 * server socket that matches.
 */
static int getServerSocketByLocalPort(
		unsigned short port //!< The port number on which a server socket is listening.
	) {
	// Loop through each of the sockets in the socket array looking for a socket
	// that is inuse, a server and has a local_port of the passed in port number.
	int socketArrayIndex;
	for (socketArrayIndex=0; socketArrayIndex<MAX_SOCKETS; socketArrayIndex++) {
		struct socketData *pSocketData = socketArray;
		if (pSocketData->state != SOCKET_STATE_UNUSED &&
			pSocketData->isServer == true &&
			pSocketData->pEspconn->proto.tcp->local_port == port)
		{
			return socketArrayIndex;
		}
		pSocketData++;
	} // End of for each socket
	return -1;
} // End of getServerSocketByLocalPort


/**
 * \brief Reset the socket to its clean and unused state.
 */
static void resetSocket(
		int sckt //!<
	) {
	struct socketData *pSocketData = getSocketData(sckt);

	memoryBuffer_delete(&pSocketData->txMemoryBuffer);

	pSocketData->pEspconn       = &espconnArray[sckt];
	pSocketData->state			= SOCKET_STATE_UNUSED;
	pSocketData->rxBuf          = NULL;
	pSocketData->rxBufLen       = 0;
	pSocketData->isServer       = false;
	pSocketData->isConnected    = false;
	pSocketData->shouldClose    = false;
	pSocketData->socketId       = sckt;
	pSocketData->errorMsg       = "";
	pSocketData->errorCode      = 0;

