espruino/Espruino/libs/network/esp8266/network_esp8266.c
	pSocketData->acceptedSocketsHead = 0; // Set the head to 0
	pSocketData->acceptedSocketsTail = 0; // Set the tail to 9.

	struct espconn *pEspconn    = pSocketData->pEspconn;
	pEspconn->type              = ESPCONN_TCP;
	pEspconn->state             = ESPCONN_NONE;
	pEspconn->proto.tcp         = &tcpArray[sckt];
	pEspconn->reverse           = NULL;


	espconn_regist_connectcb(pEspconn, esp8266_callback_connectCB_outbound);
	espconn_regist_disconcb(pEspconn, esp8266_callback_disconnectCB);
	espconn_regist_reconcb(pEspconn, esp8266_callback_reconnectCB);
	espconn_regist_sentcb(pEspconn, esp8266_callback_sentCB);
	espconn_regist_recvcb(pEspconn, esp8266_callback_recvCB);
	espconn_regist_write_finish(pEspconn, esp8266_callback_writeFinishedCB);
} // End of resetSocket


/**
 * \brief Release the socket and return it to the free pool.
 */
static void releaseSocket(
		int socketId //!< The socket id of the socket to be released.
	) {
	os_printf("> releaseSocket: %d\n", socketId);
	assert(socketId >=0 && socketId<MAX_SOCKETS);
	esp8266_dumpSocket(socketId);

	struct socketData *pSocketData = getSocketData(socketId);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);

	if (memoryBuffer_getSize(&pSocketData->txMemoryBuffer) > 0) {
		os_printf(" - Oh oh ... attempt to close socket while the TX memoryBuffer is not empty!\n");
	}
	if (pSocketData->rxBuf != NULL || pSocketData->rxBufLen != 0) {
		os_printf(" - Oh oh ... attempt to close socket while the rxBuffer is not empty!\n");
	}
	resetSocket(socketId);
	os_printf("< releaseSocket\n");
} // End of releaseSocket


/**
 * \brief Initialize the ESP8266_BOARD environment.
 * Walk through each of the sockets and initialize each one.
 */
void netInit_esp8266_board() {
	int socketArrayIndex;
	for (socketArrayIndex=0; socketArrayIndex<MAX_SOCKETS; socketArrayIndex++) {
		resetSocket(socketArrayIndex);
	} // End of for each socket
} // netInit_esp8266_board


/**
 * \brief Perform an actual closure of the socket by calling the ESP8266 disconnect API.
 * This is broken out into its own function because this can happen in
 * a number of possible places.
 */
static void doClose(
		int socketId //!< The socket id to be closed.
	) {
	struct socketData *pSocketData = getSocketData(socketId);

	if (pSocketData->state != SOCKET_STATE_CLOSING) {
		int rc = espconn_disconnect(pSocketData->pEspconn);
		pSocketData->state = SOCKET_STATE_CLOSING;

		if (rc != 0) {
			os_printf("espconn_disconnect: rc=%d\n", rc);
			setSocketInError(socketId, "espconn_disconnect", rc);
		}
	} else {
		releaseSocket(socketId);
	}
} // End of doClose


/**
 * \brief Set the given socket as being in error supplying a message and a code.
 * The socket state is placed in `SOCKET_STATE_ERROR`.
 */
static void setSocketInError(
		int socketId, //!< The socket id that is being flagged as in error.
		char *msg,    //!< A message to associate with the error.
		int code      //!< A low level error code.
	) {
	struct socketData *pSocketData = getSocketData(socketId);
	pSocketData->state     = SOCKET_STATE_ERROR;
	pSocketData->errorMsg  = msg;
	pSocketData->errorCode = code;
} // End of setSocketInError

/**
 * \brief Callback function registered to the ESP8266 environment that is
 * invoked when a new inbound connection has been formed.
 * A new connection
 * can occur when the ESP8266 makes a call out to a partner (in that
 * case the ESP8266 is acting as a client) or a new connection can
 * occur when a partner calls into a listening ESP8266.  In that case
 * the ESP8266 is acting as a server.
 */
static void esp8266_callback_connectCB_inbound(
		void *arg //!<
	) {
	os_printf(">> connectCB_inbound\n");
	struct espconn *pEspconn = (struct espconn *)arg;
	assert(pEspconn != NULL);

	dumpEspConn(pEspconn);

	int s = getServerSocketByLocalPort(pEspconn->proto.tcp->local_port);
	assert(s != -1);
	struct socketData *pSocketData = getSocketData(s);
	assert(pSocketData != NULL);

	esp8266_dumpSocket(pSocketData->socketId);

	os_printf("** new client has connected to us **\n");

	if ((pSocketData->acceptedSocketsHead + 1) % MAX_ACCEPTED_SOCKETS == pSocketData->acceptedSocketsTail) {
		os_printf("WARNING!! - Discarding inbound client because we have too many accepted clients.\n");
		os_printf("<< connectCB_inbound\n");
		return;
	}

	int clientSocket = getNextFreeSocket();
	if (clientSocket < 0) {
		os_printf("!!! Ran out of sockets !!!\n");
		return;
	}
	struct socketData *pClientSocketData = getSocketData(clientSocket);
	assert(pClientSocketData != NULL);
	pClientSocketData->pEspconn          = pEspconn;
	pClientSocketData->pEspconn->reverse = pClientSocketData;
	pClientSocketData->isServer          = false;
	pClientSocketData->isConnected       = true;
	pClientSocketData->socketId          = clientSocket;
	pClientSocketData->state             = SOCKET_STATE_IDLE;

	pSocketData->acceptedSockets[pSocketData->acceptedSocketsHead] = clientSocket;
	pSocketData->acceptedSocketsHead = (pSocketData->acceptedSocketsHead + 1) % MAX_ACCEPTED_SOCKETS;

	os_printf("<< connectCB_inbound\n");
} // End of esp8266_callback_connectCB_inbound

/**
 * \brief Callback function registered to the ESP8266 environment that is
 * invoked when a new outbound connection has been formed.
 */
static void esp8266_callback_connectCB_outbound(
		void *arg //!< A pointer to a `struct espconn`.
	) {
	os_printf(">> connectCB_outbound\n");
	struct espconn *pEspconn = (struct espconn *)arg;
	assert(pEspconn != NULL);

	dumpEspConn(pEspconn);

	struct socketData *pSocketData = (struct socketData *)pEspconn->reverse;
	assert(pSocketData != NULL);

	esp8266_dumpSocket(pSocketData->socketId);

	// Flag the socket as connected to a partner.
	pSocketData->isConnected = true;

	assert(pSocketData->state == SOCKET_STATE_CONNECTING);
	if (pSocketData->shouldClose) {
		doClose(pSocketData->socketId);
	} else {
		pSocketData->state = SOCKET_STATE_IDLE;
	}
	os_printf("<< connectCB_outbound\n");
} // End of esp8266_callback_connectCB_outbound


/**
 * \brief Callback function registered to the ESP8266 environment that is
 * Invoked when a previous connection has been disconnected.
 */
static void esp8266_callback_disconnectCB(
		void *arg //!< A pointer to a `struct espconn`.
	) {
	struct espconn *pEspconn = (struct espconn *)arg;
	struct socketData *pSocketData = (struct socketData *)pEspconn->reverse;
	assert(pSocketData != NULL);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);

