espruino/Espruino/libs/network/esp8266/network_esp8266.c
	os_printf(">> disconnectCB\n");
	dumpEspConn(pEspconn);
	esp8266_dumpSocket(pSocketData->socketId);

	// If the socket state is SOCKET_STATE_CLOSING then that means we can release the socket.  The reason
	// for this is that the last thing the user did was request an explicit socket close.
	if (pSocketData->state == SOCKET_STATE_CLOSING) {
		releaseSocket(pSocketData->socketId);
	} else {
		pSocketData->state       = SOCKET_STATE_CLOSING;
		pSocketData->isConnected = false;
	}
	os_printf("<< disconnectCB\n");
} // End of disconnectCB


/**
 *
 */
static void esp8266_callback_writeFinishedCB(
		void *arg //!< A pointer to a `struct espconn`.
	) {
	os_printf(">> writeFinishedCB\n");
	struct espconn *pEspconn = (struct espconn *)arg;
	struct socketData *pSocketData = (struct socketData *)pEspconn->reverse;
	if (pSocketData->currentTx != NULL) {
		os_free(pSocketData->currentTx);
		pSocketData->currentTx = NULL;
	}
	os_printf("<< writeFinishedCB\n");
} // End of writeFinishedCB


/**
 * \brief Error handler callback.
 * Although this is called reconnect by Espressif, this is really an error handler
 * routine.  It will be called when an error is detected.
 */
static void esp8266_callback_reconnectCB(
		void *arg, //!< A pointer to a `struct espconn`.
		sint8 err  //!< The error code.
	) {
	os_printf(">> reconnectCB:  Error code is: %d - %s\n", err, esp8266_errorToString(err));
	os_printf("<< reconnectCB");
} // End of reconnectCB


/**
 * \brief Callback function registered to the ESP8266 environment that is
 * invoked when a send operation has been completed.
 */
static void esp8266_callback_sentCB(
		void *arg //!< A pointer to a `struct espconn`.
	) {
	os_printf(">> sendCB\n");
	struct espconn *pEspconn = (struct espconn *)arg;
	struct socketData *pSocketData = (struct socketData *)pEspconn->reverse;

	assert(pSocketData != NULL);
	assert(pSocketData->state == SOCKET_STATE_TRANSMITTING);

	// We have transmitted the data ... which means that the data that was in the transmission
	// buffer can be released.
	if (pSocketData->currentTx != NULL) {
		os_free(pSocketData->currentTx);
		pSocketData->currentTx = NULL;
	}

	if (pSocketData->shouldClose) {
		doClose(pSocketData->socketId);
	} else {
		pSocketData->state = SOCKET_STATE_IDLE;
	}
	os_printf("<< sendCB\n");
} // End of sentCB


/**
 * \brief ESP8266 callback function that is invoked when new data has arrived over
 * the TCP/IP connection.
 */
static void esp8266_callback_recvCB(
		void *arg,         //!< A pointer to a `struct espconn`.
		char *pData,       //!< A pointer to data received over the socket.
		unsigned short len //!< The length of the data.
	) {
	struct espconn *pEspconn = (struct espconn *)arg;
	struct socketData *pSocketData = (struct socketData *)pEspconn->reverse;

	assert(pSocketData != NULL);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);

	os_printf(">> recvCB for socket=%d, length=%d\n", pSocketData->socketId, len);

	// If we don't have any existing unconsumed data then malloc some storage and
	// copy the received data into that storage.
	if (pSocketData->rxBufLen == 0) {
		pSocketData->rxBuf = (void *)os_malloc(len);
		memcpy(pSocketData->rxBuf, pData, len);
		pSocketData->rxBufLen = len;
	} else {
// Allocate a new buffer big enough for the original data and the new data
// Copy the original data to the start of the new buffer ...
// Copy the new new data to the offset into the new buffer just after
//   the original data.
// Release the original data.
// Update the socket data.
		uint8 *pNewBuf = (uint8 *)os_malloc(len + pSocketData->rxBufLen);
		memcpy(pNewBuf, pSocketData->rxBuf, pSocketData->rxBufLen);
		memcpy(pNewBuf + pSocketData->rxBufLen, pData, len);
		os_free(pSocketData->rxBuf);
		pSocketData->rxBuf = pNewBuf;
		pSocketData->rxBufLen += len;
	} // End of new data allocated.
	dumpEspConn(pEspconn);
	os_printf("<< recvCB\n");

} // End of recvCB


// -------------------------------------------------

/**
 * \brief Define the implementation functions for the logical network functions.
 */
void netSetCallbacks_esp8266_board(
		JsNetwork *net //!< The Network we are going to use.
	) {
	  net->idle          = net_ESP8266_BOARD_idle;
	  net->checkError    = net_ESP8266_BOARD_checkError;
	  net->createsocket  = net_ESP8266_BOARD_createSocket;
	  net->closesocket   = net_ESP8266_BOARD_closeSocket;
	  net->accept        = net_ESP8266_BOARD_accept;
	  net->gethostbyname = net_ESP8266_BOARD_gethostbyname;
	  net->recv          = net_ESP8266_BOARD_recv;
	  net->send          = net_ESP8266_BOARD_send;
} // End of netSetCallbacks_esp8266_board


/**
 * \brief Determine if there is a new client connection on the server socket.
 * This function is called to poll to see if the serverSckt has a new
 * accepted connection (socket) and, if it does, return it else return -1 to indicate
 * that there was no new accepted socket.
 */
int net_ESP8266_BOARD_accept(
		JsNetwork *net, //!< The Network we are going to use to create the socket.
		int serverSckt  //!< The socket that we are checking to see if there is a new client connection.
	) {
	//os_printf("> net_ESP8266_BOARD_accept\n");
	struct socketData *pSocketData = getSocketData(serverSckt);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);
	assert(pSocketData->isServer == true);

	// If the list is empty, return.
	if (pSocketData->acceptedSocketsHead == pSocketData->acceptedSocketsTail) {
		// Return -1 if there is no new client socket for this server.
		return -1;
	}

	// Return the 1st socket id that is in the list of accepted sockets.  We also update the
	// list to indicate that it has been read.
	int acceptedSocketId = pSocketData->acceptedSockets[pSocketData->acceptedSocketsTail];
	pSocketData->acceptedSocketsTail = (pSocketData->acceptedSocketsTail + 1) % MAX_ACCEPTED_SOCKETS;

	os_printf("> net_ESP8266_BOARD_accept: Accepted a new socket, socketId=%d\n", acceptedSocketId);
	return acceptedSocketId;
} // End of net_ESP8266_BOARD_accept


/**
 * \brief Receive data from the network device.
 * Returns the number of bytes received which may be 0 and -1 if there was an error.
 */
int net_ESP8266_BOARD_recv(
		JsNetwork *net, //!< The Network we are going to use to create the socket.
		int sckt,       //!< The socket from which we are to receive data.
		void *buf,      //!< The storage buffer into which we will receive data.
		size_t len      //!< The length of the buffer.
	) {
	assert(sckt >=0 && sckt<MAX_SOCKETS);
	struct socketData *pSocketData = getSocketData(sckt);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);

