espruino/Espruino/libs/network/esp8266/network_esp8266.c
	// If there is no data in the receive buffer, then all we need do is return
	// 0 bytes as the length of data moved.
	if (pSocketData->rxBufLen == 0) {
		if (pSocketData->state == SOCKET_STATE_CLOSING) {
			return -1;
		}
		return 0;
	}

	// If the receive buffer contains data and is it is able to fit in the buffer
	// passed into us then we can copy all the data and the receive buffer will be clear.
	if (pSocketData->rxBufLen <= len) {
		memcpy(buf, pSocketData->rxBuf, pSocketData->rxBufLen);
		int retLen = pSocketData->rxBufLen;
		os_free(pSocketData->rxBuf);
		pSocketData->rxBufLen = 0;
		pSocketData->rxBuf = NULL;
		return retLen;
	}

	// If we are here, then we have more data in the receive buffer than is available
	// to be returned in this request for data.  So we have to copy the amount of data
	// that is allowed to be returned and then strip that from the beginning of the
	// receive buffer.

	// First we copy the data we are going to return.
	memcpy(buf, pSocketData->rxBuf, len);

	// Next we allocate a new buffer and copy in the data we are not returning.
	uint8 *pNewBuf = (uint8 *)os_malloc(pSocketData->rxBufLen-len);
	memcpy(pNewBuf, pSocketData->rxBuf + len, pSocketData->rxBufLen-len);

	// Now we juggle pointers and release the original RX buffer now that we have a new
	// one.  It is likely that this algorithm can be significantly improved since there
	// is a period of time where we might actuall have TWO copies of the data.
	uint8 *pTemp = pSocketData->rxBuf;
	pSocketData->rxBuf = pNewBuf;
	pSocketData->rxBufLen = pSocketData->rxBufLen-len;
	os_free(pTemp);

	return len;
} // End of net_ESP8266_BOARD_recv.


/**
 * \brief Send data to the partner.
 * The return is the number of bytes actually transmitted which may also be
 * 0 to indicate no bytes sent or -1 to indicate an error.  For the ESP8266 implementation we
 * will return 0 if the socket is not connected or we are in the `SOCKET_STATE_TRANSMITTING`
 * state.
 */
int net_ESP8266_BOARD_send(
		JsNetwork *net,  //!< The Network we are going to use to create the socket.
		int sckt,        //!< The socket over which we will send data.
		const void *buf, //!< The buffer containing the data to be sent.
		size_t len       //!< The length of data in the buffer to send.
	) {
	assert(sckt >=0 && sckt<MAX_SOCKETS);
	os_printf("> net_ESP8266_BOARD_send: Request to send data to socket %d of size %d: ", sckt, len);

	struct socketData *pSocketData = getSocketData(sckt);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);

	// If we are not connected, then we can't currently send data.
	if (pSocketData->isConnected == false) {
		os_printf(" - Not connected\n");
		return 0;
	}

	// If we are currently sending data, we can't send more.
	if (pSocketData->state == SOCKET_STATE_TRANSMITTING) {
		os_printf(" - Currently transmitting\n");
		return 0;
	}

	// Log the content of the data we are sening.
	esp8266_board_writeString(buf, len);

	os_printf("\n");

	assert(pSocketData->state == SOCKET_STATE_IDLE);

	pSocketData->state = SOCKET_STATE_TRANSMITTING;

	// Copy the data that was passed to us to a private area.  We do this because we must not
	// assume that the data passed in will be available after this function returns.  It may have
	// been passed in on the stack.
	assert(pSocketData->currentTx == NULL);
	pSocketData->currentTx = (uint8_t *)os_malloc(len);
	memcpy(pSocketData->currentTx, buf, len);

	// Send the data over the ESP8266 SDK.
	int rc = espconn_send(pSocketData->pEspconn, pSocketData->currentTx, len);
	if (rc < 0) {
		setSocketInError(sckt, "espconn_send", rc);
		os_free(pSocketData->currentTx);
		pSocketData->currentTx = NULL;
		return -1;
	}

	esp8266_dumpSocket(sckt);
	os_printf("< net_ESP8266_BOARD_send\n");
	return len;
} // End of net_ESP8266_BOARD_send


/**
 * \brief Perform idle processing.
 * There is the possibility that we may wish to perform logic when we are idle.  For the
 * ESP8266 there is no specific idle network processing needed.
 */
void net_ESP8266_BOARD_idle(
		JsNetwork *net //!< The Network we are part of.
	) {
	// Don't echo here because it is called continuously
	//os_printf("> net_ESP8266_BOARD_idle\n");
} // End of net_ESP8266_BOARD_idle


/**
 * \brief Check for errors.
 * Returns true if there are NO errors.
 */
bool net_ESP8266_BOARD_checkError(
		JsNetwork *net //!< The Network we are going to use to create the socket.
	) {
	//os_printf("> net_ESP8266_BOARD_checkError\n");
	return true;
} // End of net_ESP8266_BOARD_checkError


/**
 * \brief Create a new socket.
 * if `ipAddress == 0`, creates a server otherwise creates a client (and automatically connects). Returns >=0 on success.
 */
int net_ESP8266_BOARD_createSocket(
		JsNetwork *net,     //!< The Network we are going to use to create the socket.
		uint32_t ipAddress, //!< The address of the partner of the socket or 0 if we are to be a server.
		unsigned short port //!< The port number that the partner is listening upon.
	) {
	os_printf("> net_ESP8266_BOARD_createSocket: host: %d.%d.%d.%d, port:%d \n", ((char *)(&ipAddress))[0], ((char *)(&ipAddress))[1], ((char *)(&ipAddress))[2], ((char *)(&ipAddress))[3], port);

	bool isServer = (ipAddress == 0);

	int sckt = getNextFreeSocket();
	if (sckt < 0) { // No free socket
		os_printf("< net_ESP8266_BOARD_createSocket: No free sockets\n");
		return -1;
	}

	struct socketData *pSocketData = getSocketData(sckt);
	struct espconn *pEspconn = pSocketData->pEspconn;

	espconn_regist_disconcb(pEspconn, esp8266_callback_disconnectCB);
	espconn_regist_reconcb(pEspconn, esp8266_callback_reconnectCB);
	espconn_regist_sentcb(pEspconn, esp8266_callback_sentCB);
	espconn_regist_recvcb(pEspconn, esp8266_callback_recvCB);
	espconn_regist_write_finish(pEspconn, esp8266_callback_writeFinishedCB);

	struct ip_info ipconfig;
	wifi_get_ip_info(STATION_IF, &ipconfig); // Get the local IP address
	os_memcpy(pEspconn->proto.tcp->local_ip, &ipconfig.ip, 4);
	pEspconn->type      = ESPCONN_TCP;
	pEspconn->state     = ESPCONN_NONE;
	pEspconn->proto.tcp = &tcpArray[sckt];
	pEspconn->reverse   = pSocketData;

	// If ipAddress != 0 then make a client connection
	if (isServer == false) {
		pSocketData->state = SOCKET_STATE_CONNECTING;
		pSocketData->isServer = false;
		pEspconn->proto.tcp->remote_port = port;
		pEspconn->proto.tcp->local_port  = espconn_port();

