espruino/Espruino/libs/network/esp8266/network_esp8266.c
		*(uint32 *)(pEspconn->proto.tcp->remote_ip) = ipAddress;

		// Ensure that we have flagged this socket as NOT connected
		pSocketData->isConnected = false;

		espconn_regist_connectcb(pEspconn, esp8266_callback_connectCB_outbound);

		// Make a call to espconn_connect.
		int rc = espconn_connect(pEspconn);
		if (rc != 0) {
			os_printf("Err: net_ESP8266_BOARD_createSocket -> espconn_connect returned: %d.  Using local port: %d\n", rc, pEspconn->proto.tcp->local_port);
			setSocketInError(sckt, "espconn_connect", rc);
		}
		/*
		os_printf("Checking to see if we are connected ...\n");
		uint32 clock= system_get_time();
		while(pSocketData->isConnected == false) {
			system_soft_wdt_feed();
			if ((system_get_time() - clock) > 10000000) {
				os_printf("clock %d\n", (unit32)clock);
				clock = system_get_time();
			}
		}
		*/
	}
	// If the ipAddress IS 0 ... then we are a server.
	else
	{
		pSocketData->state = SOCKET_STATE_IDLE;
		pSocketData->isServer = true;
		// We are going to set ourselves up as a server
		pEspconn->proto.tcp->local_port = port;

		espconn_regist_connectcb(pEspconn, esp8266_callback_connectCB_inbound);

		// Make a call to espconn_accept
		int rc = espconn_accept(pEspconn);
		if (rc != 0) {
			os_printf("Err: net_ESP8266_BOARD_createSocket -> espconn_accept returned: %d.  Using local port: %d\n", rc, pEspconn->proto.tcp->local_port);
			setSocketInError(sckt, "espconn_accept", rc);
		}
	} // End of

	dumpEspConn(pEspconn);
	os_printf("< net_ESP8266_BOARD_createSocket, socket=%d\n", sckt);
	return sckt;
} // End of net_ESP8266_BOARD_createSocket


/**
 * \brief Close a socket.
 */
void net_ESP8266_BOARD_closeSocket(
		JsNetwork *net, //!< The Network we are going to use to create the socket.
		int socketId    //!< The socket to be closed.
	) {
	os_printf("> net_ESP8266_BOARD_closeSocket, socket=%d\n", socketId);

	assert(socketId >=0 && socketId<MAX_SOCKETS);

	struct socketData *pSocketData = getSocketData(socketId);

	assert(pSocketData != NULL);
	assert(pSocketData->state != SOCKET_STATE_UNUSED);  // Shouldn't be closing an unused socket.

	dumpEspConn(pSocketData->pEspconn);
	esp8266_dumpSocket(socketId);

	// How we close the socket is a function of what kind of socket it is.
	if (pSocketData->isServer == true) {
		int rc = espconn_delete(pSocketData->pEspconn);
		if (rc != 0) {
			os_printf("espconn_delete: rc=%d\n", rc);
		}
	} // End this is a server socket
	else
	{
		if (pSocketData->state == SOCKET_STATE_IDLE || pSocketData->state == SOCKET_STATE_CLOSING) {
			doClose(socketId);
		} else {
			pSocketData->shouldClose = true;
		}
	} // End this is a client socket
} // End of net_ESP8266_BOARD_closeSocket


/**
 * \brief Callback handler for espconn_gethostbyname.
 * This is a function that will be called back by the ESP8266 when the resolution of
 * a hostname has been completed.
 */
static void dnsFoundCallback(const char *hostName, ip_addr_t *ipAddr, void *arg) {
	assert(arg != NULL);

	uint32_t *returnIp = (uint32_t *)arg;

	// ipAddr will be NULL if the IP address can not be resolved.
	if (ipAddr == NULL) {
		* returnIp = 0;
	} else {
		*returnIp = ipAddr->addr;
	}
} // End of dnsFoundCallback


/**
 * \brief Get an IP address from a name.
 * Sets 'outIp' to 0 on failure and 0xFFFFFFFF on unknown.  At some time later, the
 * IP address will be properly updated.
 */
void net_ESP8266_BOARD_gethostbyname(
		JsNetwork *net, //!< The Network we are going to use to create the socket.
		char *hostName, //!< The string representing the hostname we wish to lookup.
		uint32_t *outIp //!< The address into which the resolved IP address will be stored.
	) {
	assert(hostName != NULL);
	assert(outIp    != NULL);
	os_printf("> net_ESP8266_BOARD_gethostbyname: Resolving: %s\n", hostName);
	int rc = espconn_gethostbyname((struct espconn *)outIp, hostName, (ip_addr_t *)outIp, dnsFoundCallback);
	// A rc of ESPCONN_OK means that we have an IP and it was stored in outIp.
	// A rc of ESPCONN_INPROGRESS means that we will get the IP on a callback.
	if (rc == ESPCONN_INPROGRESS) {
		*outIp = 0xFFFFFFFF;
	}
} // End of net_ESP8266_BOARD_gethostbyname


// ----------------------------------------------------------------

/**
 * The following section is all about a logical concept called a memoryBuffer.  This is an
 * abstract data type that contains data in memory.  The operations we can perform upon it
 * are:

 * o memoryBuffer_append  - Append data to the end of the memory buffer.
 * o memoryBuffer_read    - Read a fixed number of bytes from the memory buffer.
 * o memoryBuffer_delete  - Delete the memory buffer.  No further operations should be performed
 *                          against it.
 * o memoryBuffer_getSize - Get the size of data contained in the memory buffer.
 */

/**
 * \brief Delete all content of the memory buffer.
 */
static void memoryBuffer_delete(
		struct memoryBuffer *pMemoryBuffer //!<
	) {
	if (pMemoryBuffer->length > 0) {
		os_free(pMemoryBuffer->buf);
		pMemoryBuffer->buf = NULL;
		pMemoryBuffer->length = 0;
	}
} // End of memoryBuffer_delete


/**
 * \brief Append new data to the end of the existing memory buffer.
 */
static uint8 *memoryBuffer_append(
		struct memoryBuffer *pMemoryBuffer, //!<
		uint8 *pNewData,                    //!<
		size_t length                       //!<
	) {
	assert(pMemoryBuffer != NULL);

	if (length == 0) {
		return pMemoryBuffer->buf;
	}

	assert(pNewData != NULL);

	// Handle the memory buffer being empty.
	if (pMemoryBuffer->length == 0) {
		pMemoryBuffer->buf = (uint8 *)os_malloc(length);
		if (pMemoryBuffer->buf == NULL) { // Out of memory
			jsError("malloc failed at memoryBuffer_append trying to allocate %d", length);
		} else {
			memcpy(pMemoryBuffer->buf, pNewData, length);
			pMemoryBuffer->length = length;
		}
	} else {
		// The memory buffer was not empty, so we append data.
		int newSize = pMemoryBuffer->length + length;
		uint8 *resizedStorage = (uint8 *)os_realloc(pMemoryBuffer->buf, newSize);
		if (resizedStorage != NULL) {
			pMemoryBuffer->buf = resizedStorage;
			memcpy(pMemoryBuffer->buf + length, pNewData, length);
			pMemoryBuffer->length = newSize;
		}
	}
	return pMemoryBuffer->buf;
} // End of memoryBuffer_append


/**
 * \brief Return how much data is stored in the memory buffer.
 */
static int memoryBuffer_getSize(
		struct memoryBuffer *pMemoryBuffer //!<
	) {
	assert(pMemoryBuffer != NULL);
	return pMemoryBuffer->length;
} // End of memoryBuffer_getSize


/**
 * \brief Read data from the memory buffer of an exact size.
 * The data that is returned
 * should be released with an os_free() call.
 */
static uint8 *memoryBuffer_read(
		struct memoryBuffer *pMemoryBuffer, //!<
		size_t readSize                     //!<
	) {
	assert(pMemoryBuffer != NULL);
	assert((pMemoryBuffer->length > 0 && pMemoryBuffer->buf != NULL) || pMemoryBuffer->length == 0);

	// Check that we are NOT trying to read more data than we actually have available to us.
	assert(readSize > pMemoryBuffer->length);

	// Handle the case where we are trying to read 0 bytes.
	if (readSize == 0) {
		return NULL;
	}

	// If the size of data we are willing to read is EXACTLY the size of the buffer we
	// have, then simply return a pointer to the buffer and we are done.
	if (readSize == pMemoryBuffer->length) {
		uint8 *pTemp = pMemoryBuffer->buf;
		pMemoryBuffer->buf = NULL;
		pMemoryBuffer->length = 0;
		return pTemp;
	}

	// We can assert that size < memory buffer length.
	//
	// Here we have determined that we wish to consume LESS data that we have available.
	// That means we have to split our data into parts.

	// First we build the data that we will return and copy in the memory buffer data.
	uint8 *pTemp = (uint8 *)os_malloc(readSize);
	if (pTemp == NULL) { // Out of memory
		jsError("malloc failed at memoryBuffer_append trying to allocate %d", readSize);
		return NULL;
	}
	os_memcpy(pTemp, pMemoryBuffer->buf, readSize);

	// Now we create a memory buffer to hold the remaining data that was not
	// returned.
	int newSize = pMemoryBuffer->length - readSize;
	uint8 *pTemp2 = (uint8 *)os_malloc(newSize);
	os_memcpy(pTemp2, pMemoryBuffer->buf + readSize, newSize);
	os_free(pMemoryBuffer->buf);
	pMemoryBuffer->buf = pTemp2;
	pMemoryBuffer->length = newSize;
	return pTemp;
} // End of memoryBuffer_read
// End of file
